app/controllers/school_classes_controller.rb

  def create
#    binding.pry
    @school_class = SchoolClass.create(school_class_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2016-07-05 16:53:21.674131"], ["updated_at", "2016-07-05 16:53:21.674131"]]

  def update
    set_school_class
    @school_class.update(school_class_params)
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2016-07-05 17:35:45.095233"], ["id", 1]]